"""
19. Дано натуральне число. Потрібно визначити, чи є рік з даним номером високосним.
Якщо рік є високосним, то виведіть YES, інакше виведіть NO. Нагадаємо, що відповідно
до григоріанського календаря, рік є високосним, якщо його номер кратний 4, але не кратний 100,
а також якщо він кратний 400.
"""


def calculation(year):
    """ Функция расчета является ли год высокосным """
    if year % 4 == 0 and year % 100 != 0:
        return print("YES")
    elif year % 400 == 0:
        return print("YES")
    else:
        return print("NO")


def main():
    print(" Добро пожаловать в программу расчета является ли год высокосным!")
    choice = None
    while choice != "0":
        print(
            """
            0 - Выйти
            1 - Расчитать, является ли год высокосным
            """
        )
        choice = (input("Ваш выбор - "))
        print()
        if choice == "0":
            print("До свидания!")
        elif choice == "1":
            while True:
                try:
                    y = int(input("Введите натуральный номер года "))
                    if y > 0:
                        break
                    else:
                        print("Номер должен быть натуральным!")
                except ValueError:
                    print("Несоответствие типов!")
            calculation(y)
        else:
            print("Извините, в меню нет пункта ", choice, ".")


main()
