"""
10. Дано ціле число в діапазоні 100-999. Вивести рядок-опис даного числа, наприклад:
 256 - "двісті п'ятдесят шість", 814 - "вісімсот чотирнадцять".
"""


def hundreds_dict(num: int) -> str:
    """ Функция расчета сотен трьохзначного числа """
    hundred = num // 100
    hundreds = {
        1: "Сто ",
        2: "Двесте ",
        3: "Триста ",
        4: "Четыреста ",
        5: "Пятьсот ",
        6: "Шестьсот ",
        7: "Семьсот ",
        8: "Восемьсот ",
        9: "Девятьсот "
    }
    h = hundreds.get(hundred, "Ошибка!")
    return h


def tens_dict(num: int) -> str:
    """ Функция расчета десятков трьохзначного числа """
    if (num % 100) // 10 == 1:
        ten = num % 100
    else:
        ten = (num % 100) // 10
    tens = {
        10: "десять ",
        11: "одинадцать ",
        12: "двенадцать ",
        13: "тринадцать ",
        14: "четырнадцать ",
        15: "пятнадцать ",
        16: "шестнадцать ",
        17: "семнадцать ",
        18: "восемнадцать ",
        19: "девятнадцать ",
        0: "",
        2: "двадцать ",
        3: "тридцать ",
        4: "сорок ",
        5: "пятьдесят ",
        6: "шестьдесят ",
        7: "семьдесят ",
        8: "восемьдесят ",
        9: "девяносто "
    }
    t = tens.get(ten, "Ошибка!")
    return t


def units_dict(num):
    """ Функция расчета единиц трьохзначного числа """
    if (num % 100) // 10 != 1:
        unit = num % 10
    units = {
        0: "",
        1: "один",
        2: "два",
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять"
    }
    u = units.get(unit, "Ошибка!")
    return u


def main():
    print(" Добро пожаловать в программу интерпретации числа словами!")
    choice = None
    while choice != "0":
        print(
            """
            0 - Выйти
            1 - Интерпретировать число словами
            """
        )
        choice = (input("Ваш выбор - "))
        print()
        if choice == "0":
            print("До свидания!")
        elif choice == "1":
            while True:
                try:
                    n = int(input("Введите целое число в диапазоне [100;999] "))
                    if 99 < n < 1000:
                        break
                    else:
                        print("Чимло должно находиться в диапазоне [100;999]!")
                except ValueError:
                    print("Несоответствие типов!")
            s = "Даное число - " + hundreds_dict(n) + tens_dict(n) + units_dict(n)
            print(s)
        else:
            print("Извините, в меню нет пункта ", choice, ".")


main()
